# Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.

# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.

# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

from random import randint

my_list = [randint(0, 1000) for el in range(randint(2, 14))]
print(f"Список случайных чисел {my_list}")

result = [el for el in my_list if my_list.index(el) > 0 and el > my_list[(my_list.index(el) - 1) % len(my_list)]]

if len(result) != 0:
    print(f"Элементы исходного списка, значения которых больше предыдущего элемента {result}")
else:
    print("Нет чисел удовлетворяющих условию")
